Baselines/rocksdb-leader/new_exp/ycsb/readonly/wiki/li/log.txt
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Integrated BlobDB: blob cache disabled
Keys:       24 bytes each (+ 0 bytes user-defined timestamp)
Values:     128 bytes each (64 bytes after compression)
Entries:    1000000
Prefix:    0 bytes
Keys per prefix:    0
RawSize:    145.0 MB (estimated)
FileSize:   83.9 MB (estimated)
Write rate: 0 bytes/second
Read rate: 0 ops/second
Compression: NoCompression
Compression sampling rate: 0
Memtablerep: SkipListFactory
Perf Level: 1
------------------------------------------------
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Integrated BlobDB: blob cache disabled
DB path: [/mnt/n1/dbpath/leader]
Measured TSC frequency: 2.496 GHz
Measured rdtscp overhead: 16 cycles
Measured LocalOp create overhead: 10 cycles
Measured LocalOp begin() overhead: 22 cycles
Measured LocalOp record_phase() overhead: 22 cycles
Measured LocalOp commit() overhead: 100 cycles
Using file-based key distribution from: /home/sdu/LSM/data/wiki_write_64000000.dat
Loading keys from file: /home/sdu/LSM/data/wiki_write_64000000.dat
Loaded 1000000 keys...
Loaded 2000000 keys...
Loaded 3000000 keys...
Loaded 4000000 keys...
Loaded 5000000 keys...
Loaded 6000000 keys...
Loaded 7000000 keys...
Loaded 8000000 keys...
Loaded 9000000 keys...
Loaded 10000000 keys...
Loaded 11000000 keys...
Loaded 12000000 keys...
Loaded 13000000 keys...
Loaded 14000000 keys...
Loaded 15000000 keys...
Loaded 16000000 keys...
Loaded 17000000 keys...
Loaded 18000000 keys...
Loaded 19000000 keys...
Loaded 20000000 keys...
Loaded 21000000 keys...
Loaded 22000000 keys...
Loaded 23000000 keys...
Loaded 24000000 keys...
Loaded 25000000 keys...
Loaded 26000000 keys...
Loaded 27000000 keys...
Loaded 28000000 keys...
Loaded 29000000 keys...
Loaded 30000000 keys...
Loaded 31000000 keys...
Loaded 32000000 keys...
Loaded 33000000 keys...
Loaded 34000000 keys...
Loaded 35000000 keys...
Loaded 36000000 keys...
Loaded 37000000 keys...
Loaded 38000000 keys...
Loaded 39000000 keys...
Loaded 40000000 keys...
Loaded 41000000 keys...
Loaded 42000000 keys...
Loaded 43000000 keys...
Loaded 44000000 keys...
Loaded 45000000 keys...
Loaded 46000000 keys...
Loaded 47000000 keys...
Loaded 48000000 keys...
Loaded 49000000 keys...
Loaded 50000000 keys...
Loaded 51000000 keys...
Loaded 52000000 keys...
Loaded 53000000 keys...
Loaded 54000000 keys...
Loaded 55000000 keys...
Loaded 56000000 keys...
Loaded 57000000 keys...
Loaded 58000000 keys...
Loaded 59000000 keys...
Loaded 60000000 keys...
Loaded 61000000 keys...
Loaded 62000000 keys...
Loaded 63000000 keys...
Loaded 64000000 keys...
Successfully loaded 64000000 keys from /home/sdu/LSM/data/wiki_write_64000000.dat
Updated record_count to 64000000 based on file
found count / read count 10000000 / 10000000
ycsb         :       4.712 micros/op 212218 ops/sec 47.121 seconds 10000000 operations; 2122640584.7 MB/s
Microseconds per read:
Count: 10000000 Average: 15.7712  StdDev: 34977.01
Min: 0  Median: 4.4485  Max: 110607030
Percentiles: P50: 4.45 P75: 5.23 P99: 5.99 P99.9: 9.38 P99.99: 9.97
------------------------------------------------------
[       0,       1 ]      123   0.001%   0.001% 
(       1,       2 ]    21400   0.214%   0.215% 
(       2,       3 ]    81720   0.817%   1.032% 
(       3,       4 ]  3469183  34.692%  35.724% #######
(       4,       6 ]  6365732  63.657%  99.382% #############
(       6,      10 ]    61263   0.613%  99.994% 
(      10,      15 ]      365   0.004%  99.998% 
(      15,      22 ]       58   0.001%  99.998% 
(      22,      34 ]      113   0.001% 100.000% 
(      34,      51 ]       39   0.000% 100.000% 
(      51,      76 ]        3   0.000% 100.000% 
( 110000000, 160000000 ]        1   0.000% 100.000% 

Saved read latency stats to: ../new_exp/ycsb/readonly/wiki/li//ycsb_read_latency.txt
Saved trace stats to: ../new_exp/ycsb/readonly/wiki/li/ycsb_li_stats.json